{
  "name": "Explorando el Teclado",
  "exercises": [
    {
      "title": "",
      "explanation": "Instrucciones Generales: Este laboratorio le llevará paso a paso a identificar todos los componentes del teclado y las funciones de cada tecla.​ </br></br> Lea bien y siga las instrucciones.​ </br></br> 1. En las definiciones y ejercicios las teclas estarán identificadas según el siguiente ejemplo con el fondo negro y la letra blanca: <span class='key-highlight'>Tab</span> </br></br> 2. Pulse el botón abajo <b>(Continuar)</b> para continuar los ejercicios. Si desea repetir el ejercicio puede darle <b>Continuar</b> y luego <b>Regresar</b> para repetirlo​​",
      "task": false,
      "objective": "FREE",
      "keyboard": false,
      "keys": "",
      "textarea": false,
      "imageSrc": ""
    },
    {
      "title": "Partes del Teclado",
      "explanation": "El teclado de la computadora tiene la misma configuración del teclado de la maquinilla. El mismo ha ido evolucionando y se han añadido algunas teclas y se han aumentado sus funciones. Aunque todos los teclados deberían ser iguales, es posible que algunos símbolos podrían verse diferentes y algunos nombres de las teclas son abreviados. Verifique su teclado mientras realiza los ejercicios y observe bien las ilustraciones de las localizaciones de las teclas para que no tenga dudas. El ejercicio se hará con el teclado  idioma Inglés que se usa en Puerto Rico, que no tiene algunos caracteres del lenguaje español.​ </br></br> El teclado se divide en 5 partes.",
      "task": "Mueve el ratón sobre el dibujo para iluminar cada parte.",
      "objective": "FREE",
      "keyboard": false,
      "keys": "",
      "textarea": false,
      "imageSrc": "/1-keyboard-parts.png"
    },
    {
      "title": "Teclas de escritura",
      "explanation": "Las teclas de Escritura incluyen las que se utilizan para escribir, mover y editar texto tales como; Letras, Símbolos,  Tabulador <span class='key-highlight'>Tab</span>, Bloqueo de Mayúscula <span class='key-highlight'>Caps Lock</span>, Retroceso <span class='key-highlight'>Backspace</span>, Fijador de Mayúscula <span class='key-highlight'>Shift</span>, Barra Espaciadora <span class='key-highlight'>Space Bar</span> y Entrada <span class='key-highlight'>Enter</span>. Con la excepción de la tecla <span class='key-highlight'>Shift</span> y <span class='key-highlight'>Caps Lock</span> todas las demás teclas deben presionarse una sola vez, de lo contrario se repetirán hasta que sueltes la tecla. ",
      "instructions": "Observe el siguiente cuadro. Presione cualquier tecla de su teclado durante 3 segundos y observe lo que ocurre.",
      "objective": "FREE",
      "keyboard": false,
      "textarea": true,
      "keys": "",
      "imageSrc": "/2-main-keys.png"
    },
    {
      "title": "Teclas de escritura - Letras",
      "explanation": "Las teclas de letra se encuentran en el mismo centro del teclado. Incluyen todas las letras del abecedario.",
      "instructions": "Escriba su nombre en el cuadro de texto inferior:",
      "objective": "FREE",
      "keyboard": false,
      "textarea": true,
      "keys": "",
      "imageSrc": "/3-letter-keys.png"
    },
    {
      "title": "Teclas de Escritura - Números y Signos",
      "explanation": "Las teclas numéricas se encuentran en la parte superior del teclado. Incluye los números del 0 al nueve. Sobre los números se encuentran los signos numéricos más utilizados. </br></br> Las que están en el teclado numérico a la derecha todavía no las use. Para escribir los números simplemente presionas la tecla del número que desees.",
      "instructions": "En el cuatro de abajo intenta escribir: 435",
      "objective": "MATCH",
      "match": "435",
      "keyboard": false,
      "textarea": true,
      "keys": "",
      "imageSrc": "/4-numbers-signs.png"
    },
    {
      "title": "Teclas de Escritura - Signos",
      "explanation": "Observe las teclas que tienen más de un objeto, sea números o símbolos. Uno está localizado en la parte superior y el otro en la parte inferior. Para obtener el objeto que está en la parte superior deberá; </br></br> 1. Presionar y sostener la tecla <span class='key-highlight'>Shift</span> </br></br> 2. Presionar la tecla deseada </br></br> 3. Soltar la tecla <span, class='key-highlight'>Shift</span>",
      "instructions": "Intenta escribir: 548*4+4,000/2=4,192",
      "objective": "MATCH",
      "match": "548*4+4,000/2=4,192",
      "keyboard": false,
      "textarea": true,
      "keys": "",
      "imageSrc": "/5-sign-keys.png"
    },
    {
      "title": "Teclas de Escritura - Tabulador",
      "explanation": "La tecla de Tabulación tiene dos funciones: </br></br> 1. Cuando comienzas a escribir una oración y presionas la misma salta cinco espacios. Lo puedes hacer en Word cuando quieras hacer la sangría. La tecla originalmente tenía un símbolo que significaba que va hacia adelante y hacia atrás.",
      "instructions": "Presiona la tecla TAB y escribe tu apodo",
      "objective": "FREE",
      "match": "",
      "keyboard": false,
      "textarea": true,
      "keys": "",
      "imageSrc": "/6-tab.png",
      "allowTab": true
    },
    {
      "title": "Teclas de Escritura - Tabulador",
      "explanation": "2. La otra función es cuando entras datos en cuadros de texto. Presionas la tecla <span class='key-highlight'>Tab</span> y se mueve al próximo cuadro. </br></br> 3. Si le das <span class='key-highlight'>Shift</span> y <span class='key-highlight'>Tab</span> simultáneamente se mueve hacia atrás. Para hacerlo fácil, primero presiona la tecla <span class='key-highlight'>Shift</span> y sostenla, luego presionas la tecla <span class='key-highlight'>Tab</span> varias veces y se moverá hacia atrás.",
      "instructions": "1. Coloca el cursor sobre cuadro del nombre y escribe tu nombre. </br></br> 2. Presiona la tecla <span class='key-highlight'>Tab</span> y escribe tu apellido paterno </br></br> 3. Presiona la tecla <span class='key-highlight'>Tab</span> y escribe tu apellido materno </br></br> 4. Presiona la tecla <span class='key-highlight'>Shift</span> + <span class='key-highlight'>Tab</span> simultáneamente y el cursor se moverá hacia atrás.",
      "objective": "SPECIAL",
      "match": "",
      "keyboard": false,
      "textarea": true,
      "keys": "",
      "imageSrc": "/6-tab.png",
      "allowTab": false,
      "specialInputs": [
        { "placeholder": "Nombre" },
        { "placeholder": "Apellido Paterno" },
        { "placeholder": "Apellido Materno" }
      ]
    },
    {
      "title": "Teclas de Escritura - Mayúscula (Shift)",
      "explanation": "La tecla <b>Fijador de Mayúscula</b> <span class='key-highlight'>Shift</span> se usa cuando comienzas una oración, en los nombres propios incluyendo animales, nombres geográficos, atributos divinos, entre otros.",
      "instructions": "Escribe la palabra <b>Mayúscula</b>. </br></br> 1. Para obtener la letra mayúscula presionas la tecla  <span class='key-highlight'>Shift</span> y sostenla </br></br> 2. Presiona la tecla <span class='key-highlight'>M</span> y suelta la techa <span class='key-highlight'>Shift</span> y ésta aparecerá en mayúscula y continúa con el resto de las letras.",
      "objective": "FREE",
      "match": "",
      "keyboard": false,
      "textarea": true,
      "keys": "",
      "imageSrc": "/7-shift.png",
      "allowTab": true
    },
    {
      "title": "Teclas de Escritura - Bloquear Mayúscula (Caps lock)",
      "explanation": "Cuando vas a escribir más de una letra mayúscula, como los títulos de documentos y encabezados, presionas la tecla <span class='key-highlight'>Caps Lock</span> para activarla y todas las letras que escribas serán en mayúscula. Cuanto termines la desactivas y puedes continuar escribiendo el resto del texto. Algunos teclados tienen una luz verde en la tecla indicando que está activada y otros tienen una luz indicadora como muestra la imagen a la derecha en la parte superior derecha.",
      "instructions": "En el siguiente cuadro de texto escribe en mayúscula la palabra <b>MAYUSCULA</b>",
      "objective": "MATCH",
      "match": "MAYUSCULA",
      "keyboard": false,
      "textarea": true,
      "keys": "",
      "imageSrc": "/8-caps-lock.png",
      "allowTab": true
    },
    {
      "title": "Teclas de Escritura - Retroceso Backspace",
      "explanation": "La tecla <span class='key-highlight'>Backspace</span> se usa para borrar, por lo general cuando estás escribiendo y cometes un error, la presionas y borra hacia atrás o sea haca la izquierda hasta corregir el error. En el siguiente ejercicio hay una oración, pero con un error al final.",
      "instructions": "1. Coloca el cursor después de la letra “s” de la palabra “orasión”. </br></br> 2. Presiona la tecla  Backspace, borra la “s” y escribe la “c”.",
      "objective": "MATCH",
      "match": "Elimina el error de esta orasión.",
      "keyboard": false,
      "textarea": true,
      "keys": "",
      "imageSrc": "/9-backspace.png",
      "allowTab": true
    }
  ]
}