{
  "name": "Explorando el Teclado",
  "exercises": [
    {
      "title": "",
      "explanation": "Instrucciones Generales: Este laboratorio le llevará paso a paso a identificar todos los componentes del teclado y las funciones de cada tecla.​ </br></br> Lea bien y siga las instrucciones.​ </br></br> 1. En las definiciones y ejercicios las teclas estarán identificadas según el siguiente ejemplo con el fondo negro y la letra blanca: <span class='key-highlight'>Tab</span> </br></br> 2. Pulse el botón abajo <b>(Continuar)</b> para continuar los ejercicios. Si desea repetir el ejercicio puede darle <b>Continuar</b> y luego <b>Regresar</b> para repetirlo​​",
      "task": false,
      "objective": "FREE",
      "keyboard": false,
      "textInput": false,
      "imageSrc": ""
    },
    {
      "title": "Partes del Teclado",
      "explanation": "El teclado de la computadora tiene la misma configuración del teclado de la maquinilla. El mismo ha ido evolucionando y se han añadido algunas teclas y se han aumentado sus funciones. Aunque todos los teclados deberían ser iguales, es posible que algunos símbolos podrían verse diferentes y algunos nombres de las teclas son abreviados. Verifique su teclado mientras realiza los ejercicios y observe bien las ilustraciones de las localizaciones de las teclas para que no tenga dudas. El ejercicio se hará con el teclado  idioma Inglés que se usa en Puerto Rico, que no tiene algunos caracteres del lenguaje español.​ </br></br> El teclado se divide en 5 partes.",
      "task": "Mueve el ratón sobre el dibujo para iluminar cada parte.",
      "objective": "FREE",
      "keyboard": false,
      "textInput": false,
      "imageSrc": "/modulo-1/1-keyboard-parts.png"
    },
    {
      "title": "Teclas de escritura",
      "explanation": "Las teclas de Escritura incluyen las que se utilizan para escribir, mover y editar texto tales como; Letras, Símbolos,  Tabulador <span class='key-highlight'>Tab</span>, Bloqueo de Mayúscula <span class='key-highlight'>Caps Lock</span>, Retroceso <span class='key-highlight'>Backspace</span>, Fijador de Mayúscula <span class='key-highlight'>Shift</span>, Barra Espaciadora <span class='key-highlight'>Space Bar</span> y Entrada <span class='key-highlight'>Enter</span>. Con la excepción de la tecla <span class='key-highlight'>Shift</span> y <span class='key-highlight'>Caps Lock</span> todas las demás teclas deben presionarse una sola vez, de lo contrario se repetirán hasta que sueltes la tecla. ",
      "instructions": "Observe el siguiente cuadro. Presione cualquier tecla de su teclado durante 3 segundos y observe lo que ocurre.",
      "objective": "FREE",
      "keyboard": false,
      "textInput": true,
      "imageSrc": "/modulo-1/2-main-keys.png"
    },
    {
      "title": "Teclas de escritura - Letras",
      "explanation": "Las teclas de letra se encuentran en el mismo centro del teclado. Incluyen todas las letras del abecedario.",
      "instructions": "Escriba su nombre en el cuadro de texto inferior:",
      "objective": "FREE",
      "keyboard": false,
      "textInput": true,
      "imageSrc": "/modulo-1/3-letter-keys.png"
    },
    {
      "title": "Teclas de Escritura - Números y Signos",
      "explanation": "Las teclas numéricas se encuentran en la parte superior del teclado. Incluye los números del 0 al nueve. Sobre los números se encuentran los signos numéricos más utilizados. </br></br> Las que están en el teclado numérico a la derecha todavía no las use. Para escribir los números simplemente presionas la tecla del número que desees.",
      "instructions": "En el cuatro de abajo intenta escribir: 435",
      "objective": "MATCH",
      "match": "435",
      "keyboard": false,
      "textInput": true,

      "imageSrc": "/modulo-1/4-numbers-signs.png"
    },
    {
      "title": "Teclas de Escritura - Signos",
      "explanation": "Observe las teclas que tienen más de un objeto, sea números o símbolos. Uno está localizado en la parte superior y el otro en la parte inferior. Para obtener el objeto que está en la parte superior deberá; </br></br> 1. Presionar y sostener la tecla <span class='key-highlight'>Shift</span> </br></br> 2. Presionar la tecla deseada </br></br> 3. Soltar la tecla <span, class='key-highlight'>Shift</span>",
      "instructions": "Intenta escribir: 548*4+4,000/2=4,192",
      "objective": "MATCH",
      "match": "548*4+4,000/2=4,192",
      "keyboard": false,
      "textInput": true,
      "imageSrc": "/modulo-1/5-sign-keys.png"
    },
    {
      "title": "Teclas de Escritura - Tabulador",
      "explanation": "La tecla de Tabulación tiene dos funciones: </br></br> 1. Cuando comienzas a escribir una oración y presionas la misma salta cinco espacios. Lo puedes hacer en Word cuando quieras hacer la sangría. La tecla originalmente tenía un símbolo que significaba que va hacia adelante y hacia atrás.",
      "instructions": "Presiona la tecla TAB y escribe tu apodo",
      "objective": "FREE",
      "match": "",
      "keyboard": false,
      "textInput": true,
      "imageSrc": "/modulo-1/6-tab.png",
      "allowTab": true
    },
    {
      "title": "Teclas de Escritura - Tabulador",
      "explanation": "2. La otra función es cuando entras datos en cuadros de texto. Presionas la tecla <span class='key-highlight'>Tab</span> y se mueve al próximo cuadro. </br></br> 3. Si le das <span class='key-highlight'>Shift</span> y <span class='key-highlight'>Tab</span> simultáneamente se mueve hacia atrás. Para hacerlo fácil, primero presiona la tecla <span class='key-highlight'>Shift</span> y sostenla, luego presionas la tecla <span class='key-highlight'>Tab</span> varias veces y se moverá hacia atrás.",
      "instructions": "1. Coloca el cursor sobre cuadro del nombre y escribe tu nombre. </br></br> 2. Presiona la tecla <span class='key-highlight'>Tab</span> y escribe tu apellido paterno </br></br> 3. Presiona la tecla <span class='key-highlight'>Tab</span> y escribe tu apellido materno </br></br> 4. Presiona la tecla <span class='key-highlight'>Shift</span> + <span class='key-highlight'>Tab</span> simultáneamente y el cursor se moverá hacia atrás.",
      "objective": "SPECIAL",
      "match": "",
      "keyboard": false,
      "textInput": true,

      "imageSrc": "/modulo-1/6-tab.png",
      "allowTab": false,
      "specialInputs": [
        { "placeholder": "Nombre", "input": "" },
        { "placeholder": "Apellido Paterno", "input": "" },
        { "placeholder": "Apellido Materno", "input": "" }
      ]
    },
    {
      "title": "Teclas de Escritura - Mayúscula (Shift)",
      "explanation": "La tecla <b>Fijador de Mayúscula</b> <span class='key-highlight'>Shift</span> se usa cuando comienzas una oración, en los nombres propios incluyendo animales, nombres geográficos, atributos divinos, entre otros.",
      "instructions": "Escribe la palabra <b>Mayúscula</b>. </br></br> 1. Para obtener la letra mayúscula presionas la tecla  <span class='key-highlight'>Shift</span> y sostenla </br></br> 2. Presiona la tecla <span class='key-highlight'>M</span> y suelta la techa <span class='key-highlight'>Shift</span> y ésta aparecerá en mayúscula y continúa con el resto de las letras.",
      "objective": "FREE",
      "match": "",
      "keyboard": false,
      "textInput": true,
      "imageSrc": "/modulo-1/7-shift.png",
      "allowTab": true
    },
    {
      "title": "Teclas de Escritura - Bloquear Mayúscula (Caps lock)",
      "explanation": "Cuando vas a escribir más de una letra mayúscula, como los títulos de documentos y encabezados, presionas la tecla <span class='key-highlight'>Caps Lock</span> para activarla y todas las letras que escribas serán en mayúscula. Cuanto termines la desactivas y puedes continuar escribiendo el resto del texto. Algunos teclados tienen una luz verde en la tecla indicando que está activada y otros tienen una luz indicadora como muestra la imagen a la derecha en la parte superior derecha.",
      "instructions": "En el siguiente cuadro de texto escribe en mayúscula la palabra <b>MAYUSCULA</b>",
      "objective": "MATCH",
      "match": "MAYUSCULA",
      "keyboard": false,
      "textInput": true,
      "imageSrc": "/modulo-1/8-caps-lock.png",
      "allowTab": true
    },
    {
      "title": "Teclas de Escritura - Retroceso Backspace",
      "explanation": "La tecla <span class='key-highlight'>Backspace</span> se usa para borrar, por lo general cuando estás escribiendo y cometes un error, la presionas y borra hacia atrás o sea haca la izquierda hasta corregir el error. En el siguiente ejercicio hay una oración, pero con un error al final.",
      "instructions": "1. Coloca el cursor después de la letra “s” de la palabra “orasión”. </br></br> 2. Presiona la tecla  Backspace, borra la “s” y escribe la “c”.",
      "objective": "MATCH",
      "match": "Elimina el error de esta oración.",
      "keyboard": false,
      "textInput": true,
      "imageSrc": "/modulo-1/9-backspace.png",
      "allowTab": true,
      "input": "Elimina el error de esta orasión."
    },
    {
      "title": "Teclas de Escritura - Retroceso Backspace",
      "explanation": "La tecla <span class='key-highlight'>Backspace</span> no solo se usa para borrar lo que está al final de una oración. Si usted observa un error en una oración, puede colocar el cursor después de la palabra errónea y borrarla para corregirla. En el siguiente ejercicio hay una palabra incorrecta.",
      "instructions": "1. Coloca el cursor después de la palabra “horror”. </br></br> 2. Borra la misma con la tecla <span class='key-highlight'>Bakcspace</span>. </br></br> 3. Luego escribe la palabra error.",
      "objective": "MATCH",
      "match": "Elimina el error de esta oración.",
      "keyboard": false,
      "textInput": true,
      "imageSrc": "/modulo-1/9-backspace.png",
      "allowTab": true,
      "input": "Elimina el horror de esta oración."
    },
    {
      "title": "Teclas de Escritura - Entrada Enter",
      "explanation": "La tecla <span class='key-highlight'>Enter</span> se usa para para empezar una nueva línea cuando estás escribiendo y en algunos programas de Tab las se mueve a la próxima fila. También se usa para confirmar acciones en cuando un programa lo requiere. Observa la imagen que muestra dos teclas Enter, una en el grupo teclado alfanumérico en el centro y la otra en el teclado numérico.",
      "instructions": "Escribe tu nombre abajo y presiona <span class='key-highlight'>Enter</span>.",
      "objective": "FREE",
      "match": "",
      "keyboard": false,
      "textInput": true,
      "imageSrc": "/modulo-1/11-enter.png",
      "allowTab": true,
      "input": "",
      "inputType": "TEXTAREA"
    },
    {
      "title": "Teclas de Control",
      "explanation": "Las teclas de Control tienen determinadas tareas relacionadas con la computadora. Se pueden usar solas y en combinación con otras teclas. Las teclas son: <span class='key-highlight'>Esc</span>, <span class='key-highlight'>Ctrl</span>, <span class='key-highlight'>Alt</span>, <span class='key-highlight'>Ins</span>, <span class='key-highlight'>Del</span>, <span class='key-highlight'>Print Scr</span> y <span class='key-highlight'>Windows</span>. Las teclas <span class='key-highlight'>Scroll Lock</span> y <span class='key-highlight'>Pause/Break</span> actualmente ya no se usan.",
      "instructions": "",
      "objective": "FREE",
      "match": "",
      "keyboard": false,
      "textInput": false,
      "imageSrc": "/modulo-1/12-ctrl.png",
      "allowTab": true,
      "input": "",
      "inputType": "NONE"
    },
    {
      "title": "Teclas de Control - Tecla Windows y Esc",
      "explanation": "La tecla <span class='key-highlight'>Windows</span> activa el menú del Sistema Operativo Windows y en combinación con otras teclas tiene otras funciones. </br></br> La tecla <span class='key-highlight'>Esc</span> depende del programa que estés utilizando. En algunos te indicará cuando usarla y por lo general es para salir de un programa. Otro uso frecuente es cuando por error activas una ventana emergente y la cierras con esta.",
      "instructions": "1. Presiona la tecla <span class='key-highlight'>Windows</span> y se abrirá el menú de inicio de Windows. Luego presiona la tecla <span class='key-highlight'>Esc</span> para cerrarla. </br></br> 2. Presiona la tecla <span class='key-highlight'>Windows</span> sostenla y luego presiona la letra <span class='key-highlight'>P</span>, entonces abrirá el menú para conectar la computadora con otro monitor que ha sido conectado previamente. Presiona <span class='key-highlight'>Esc</span> para cerrarla.",
      "objective": "FREE",
      "match": "",
      "keyboard": false,
      "textInput": false,
      "imageSrc": "/modulo-1/13-esc-win.png",
      "allowTab": true,
      "input": "",
      "inputType": "NONE"
    },
    {
      "title": "Teclas de Control - Tecla Ctrl",
      "explanation": "Otro de los muchos usos de la tecla <span class='key-highlight'>Ctrl</span> es mover información de un lugar a otro en  combinación con la letra <span class='key-highlight'>X</span>.",
      "instructions": "1. Dale clic tres veces a la oración en el cuadro izquierdo para sombrearla o seleccionarla (en esta ocasión significa lo mismo). </br></br> 2. Presiona y sostén la tecla <span class='key-highlight'>CTRL</span> y la letra <span class='key-highlight'>X</span>. </br></br> 3. Dale clic en el cuadro de la derecha, presiona el presiona y sostén la tecla <span class='key-highlight'>CTRL</span> y la letra <span class='key-highlight'>V</span>. </br></br> 4. Verás que moviste la oración de un lugar a otro.",
      "objective": "SPECIAL",
      "match": "",
      "keyboard": false,
      "textInput": true,
      "imageSrc": "/modulo-1/14-ctrl.png",
      "allowTab": true,
      "input": "",
      "specialInputs": [
        { "placeholder": "", "input": "Copia este texto" },
        { "placeholder": "", "input": "" }
      ],
      "inputType": "TEXT"
    },
    {
      "title": "Teclas de Control - Tecla Del",
      "explanation": "La tecla <span class='key-highlight'>Del</span> al igual que la tecla <span class='key-highlight'>Backspace</span> borra los caracteres, pero borra los que están a la derecha.",
      "instructions": "En el cuadro inferior corrige los dos errores ortográficos con la tecla <span class='key-highlight'>Del</span>. </br></br> 1. Coloca el cursor antes de la letra <b>“i”</b> de la palabra <b>“estoi”</b> y presiona la tecla <span class='key-highlight'>Del</span> para borrarla y escribe la <b>“y”</b> para corregirla. </br></br> 2. Repite los mismos pasos para la palabra <b>“uzar”</b> y borra la letra <b>“z”</b> y escribe la <b>“s”</b>.",
      "objective": "MATCH",
      "match": "¡Qué bueno que estoy aprendiendo a usar el teclado poco a poco!",
      "keyboard": false,
      "textInput": true,
      "imageSrc": "/modulo-1/15-del.png",
      "allowTab": true,
      "input": "¡Qué bueno que estoi aprendiendo a uzar el teclado poco a poco!",
      "specialInputs": "",
      "inputType": "TEXT"
    },
    {
      "title": "Teclas de Control - Tecla Alt",
      "explanation": "La tecla <span class='key-highlight'>Alt</span> por sí sola no tiene ninguna función, pero en combinación con otras teclas nos permite insertar caracteres que no están incluidos en el teclado tales como; © y  ®, entre otros. También nos permite cerrar ventanas, activar menús, etc. Algunos programas la usan para sus propias funciones.",
      "instructions": "1. Dale clic a al primer cuadro y presiona tecla <span class='key-highlight'>Alt</span>, sostenla y escribe en el teclado numérico el número 160 y presiona la tecla <span class='key-highlight'>Tab</span>. </br></br> 2. Observa que se movió a al próximo cuadro. </br></br> Sigue las mismas instrucciones con los números: 130, 161, 162, 163 y 164.",
      "objective": "SPECIAL",
      "match": "",
      "keyboard": false,
      "textInput": true,
      "imageSrc": "/modulo-1/16-alt.png",
      "allowTab": false,
      "input": "",
      "specialInputs": [
        { "placeholder": "", "input": "" },
        { "placeholder": "", "input": "" },
        { "placeholder": "", "input": "" },
        { "placeholder": "", "input": "" },
        { "placeholder": "", "input": "" },
        { "placeholder": "", "input": "" }
      ],
      "inputType": "TEXT"
    },
    {
      "title": "Teclas de Control - Print Screen",
      "explanation": "La tecla <span class='key-highlight'>Prn Scr</span> significa <b>“Print Screen”</b> o sea imprimir pantalla. Esto no significa que lo que está en pantalla saldrá en la impresora. Simplemente lo que hace es guardar temporeramente en memoria una foto del contenido en pantalla la cual puedes hacer aparecer en un procesador de texto con el comando <b>“Copiar”</b>. Si oprimes las teclas <span class='key-highlight'>Ctrl</span> + <span class='key-highlight'>V</span> saldrá la pantalla en la página. </br></br> <img src='/imgs/17-prn-scr.png' class='w-100' /> </br></br> Si combinas las teclas <span class='key-highlight'>Alt</span> + <span class='key-highlight'>Prt Scr</span> copiarás la ventana activa si tuvieras más de una ventana abierta. </br></br> A continuación, dos ejemplos de cómo copiar con <span class='key-highlight'>Prt Scr</span> y con <span class='key-highlight'>Alt</span> + <span class='key-highlight'>Prt Scr</span>. </br></br> La imagen que ven abajo es lo que se ve en mi pantalla con una ventana de internet media abierta (no cubre la pantalla completa). Si presiono la tecla <span class='key-highlight'>Prn Scr</span> en Word, saldría exactamente lo que está en mi pantalla. </br></br> <img src='/imgs/18-screen.png' class='w-100' /> </br></br> Si en mi pantalla tengo activa o sea que estoy usando la ventana que está media abierta y presiono la tecla <span class='key-highlight'>Alt</span> + <span class='key-highlight'>Prn Scr</span> en Word saldría la ventana activa según muestra la imagen abajo. </br></br> <img src='/imgs/19-screen-2.png' class='w-100' />",
      "instructions": "",
      "objective": "NONE",
      "match": "",
      "keyboard": false,
      "textInput": false,
      "imageSrc": "",
      "allowTab": false,
      "input": "",
      "specialInputs": "",
      "inputType": "NONE"
    },
    {
      "title": "Teclas de Función",
      "explanation": "Las teclas de Función al igual que la tecla <span class='key-highlight'>Alt</span> y <span class='key-highlight'>Ctrl</span>, tienen unas funciones específicas dependiendo del programa que estés usando. Estas funcionan por sí misma y en combinación.  En un programa de contabilidad no funcionarían igual que en uno de diseño.",
      "instructions": "En el cuadro inferior dale clic tres veces en cualquier parte del texto seleccionar y presiona la tecla <span class='key-highlight'>F1</span> y la <span class='key-highlight'>F2</span>",
      "objective": "FREE",
      "match": "¡Qué bueno que estoy aprendiendo a usar el teclado poco a poco!",
      "keyboard": false,
      "textInput": true,
      "imageSrc": "/modulo-1/20-function.png",
      "allowTab": false,
      "input": "En este ejercicio se programaron la F1 y F2 para agrandar y achicar el tamaño del texto.",
      "specialInputs": "",
      "inputType": "TEXT"
    },
    {
      "title": "Teclas de Función - Botones de Símbolos",
      "explanation": "La tecla <span class='key-highlight'>Fn</span> es más común en lo teclados de las computadoras portátiles (Laptops). Por sí sola no tiene uso y por lo general se combina con unos símbolos relacionados al ajuste de los componentes de la computadora. En el teclado de la computadora de escritorio que es más grande tiene unas pequeñas teclas con símbolos con ciertas funciones. Pero el teclado de la portátil se combina la tecla <span class='key-highlight'>Fn</span> con unas teclas con dos funciones. Por lo general se encuentra al lado o cerca de la tecla <span class='key-highlight'>Ctrl</span> y <span class='key-highlight'>Alt</span>",
      "instructions": "",
      "objective": "FREE",
      "match": "",
      "keyboard": false,
      "textInput": false,
      "imageSrc": "/modulo-1/21-symbol.png",
      "allowTab": false,
      "input": "",
      "specialInputs": "",
      "inputType": "TEXT"
    },
    {
      "title": "Teclas de Navegación - Inicio (Home)",
      "explanation": "Las teclas <span class='key-highlight'>Home</span> y <span class='key-highlight'>End</span> colocan el cursor al principio y al final de la línea. En algunos programas en combinación con la tecla <span class='key-highlight'>Ctrl</span> coloca el cursor en la primera página y en la última página.",
      "instructions": "1. En el cuadro inferior coloca el cursor en el centro donde desee y presiona la tecla <span class='key-highlight'>Home</span>. Observa a dónde se movió. </br></br> 2. Presiona la tecla <span class='key-highlight'>End</span>. Observa a dónde se movió y repite varias veces el ejercicio. </br></br> 3. Presiona las teclas <span class='key-highlight'>Ctrl</span> + <span class='key-highlight'>Home</span>. Observa a dónde se movió. </br></br> 4. Presiona las teclas <span class='key-highlight'>Ctrl</span> + <span class='key-highlight'>End</span> y observa a dónde se movió y repite varias veces el ejercicio.",
      "objective": "FREE",
      "match": "",
      "keyboard": false,
      "textInput": true,
      "imageSrc": "/modulo-1/23-end.png",
      "allowTab": false,
      "input": "Las teclas de Navegación se utilizan para desplazarse en las páginas de Internet y de texto. Una pantalla de computadora no puede mostrar a la vez toda la información disponible para lo cual es necesario identificar las teclas que nos permitan movernos de un lugar a otro para ser más eficientes. Aunque el mouse nos permite movernos también en algunas ocasiones el teclado nos ayuda, pero solo con la práctica usted encontrará su mejor uso. Algunas abreviaturas podrían aplicar en algunos teclados, al igual que las flechas podrían ser sustituidas por un símbolo como el siguiente:",
      "specialInputs": "",
      "inputType": "TEXTAREA"
    },
    {
      "title": "Teclas de Navegación - Inicio (Home)",
      "explanation": "Las Flechas direccionales nos permiten mover el cursor a todas las direcciones verticales (arriba y abajo) y horizontales (derecha e izquierda).",
      "instructions": "En el cuadro inferior coloca el cursor en el lugar donde desees y mueve las flechas direccionales en las cuatro direcciones; arriba, abajo, derecha e izquierda.",
      "objective": "FREE",
      "match": "",
      "keyboard": false,
      "textInput": true,
      "imageSrc": "/modulo-1/24-arrows.png",
      "allowTab": false,
      "input": "Las teclas de Navegación se utilizan para desplazarse en las páginas de Internet y de texto. Una pantalla de computadora no puede mostrar a la vez toda la información disponible para lo cual es necesario identificar las teclas que nos permitan movernos de un lugar a otro para ser más eficientes. Aunque el mouse nos permite movernos también en algunas ocasiones el teclado nos ayuda, pero solo con la práctica usted encontrará su mejor uso. Algunas abreviaturas podrían aplicar en algunos teclados, al igual que las flechas podrían ser sustituidas por un símbolo como el siguiente:",
      "specialInputs": "",
      "inputType": "TEXTAREA"
    }
  ]
}
